#!/usr/bin/env python
# coding=utf-8

a = 123  # 十进制整数
b = 0b1010  # 二进制整数，等于十进制的 10
c = 0o12  # 八进制整数，等于十进制的 10
d = 0x0A  # 十六进制整数，等于十进制的 10
print(a, b, c, d) # 123 10 10 10


a = 3.14e-2         # 科学计数法表示的浮点数，等于 0.0314
b = 1.23            # 普通的浮点数
print(a, b)         # 0.0314 1.23


a = 1 + 2j          # 复数
b = complex(3, 4)   # 复数，等于 3+4j
print(a, b)         # (1+2j) (3+4j)


a = True
b = False
c = 1 + True
d = 3 * False
print(a, b, c, d)   # True False 2 0


a = 7 / 2
b = 7 // 2
c = 7 % 2
d = 2 ** 3
print(a, b, c, d)    # 3.5 3 1 8

a = int("123")       # 将字符串 "123" 转换为整数类型
b = float("3.14")    # 将字符串 "3.14" 转换为浮点数类型
c = complex("1+2j")  # 将字符串 "1+2j" 转换为复数类型
print(a, b, c)       # 123 3.14 (1+2j)

a = str(123)                     # 将整数 123 转换为字符串类型
b = repr(3.1415926)              # 将浮点数 3.1415926 转换为字符串类型，使用 repr() 函数可以保留小数点后的精度
c = "{:.2f}".format(3.1415926)   # 将浮点数 3.1415926 转换为字符串类型，保留小数点后两位
print(a, b, c)                   # 123 3.1415926 3.14



